app/controllers/messages_controller.rb

SELECT  `messages`.* FROM `messages` WHERE `messages`.`id` = 4 LIMIT 1
UPDATE `messages` SET `showable` = 1, `status` = 1, `updated_at` = '2017-09-14 01:43:06' WHERE `messages`.`id` = 4
---
  def to_examine
    @message = Message.find(params[:id])
    if params[:showable].present?
      @message.update(showable: Message.showables[:show], status: Message.statuses[:active])

INSERT INTO `messages` (`context`, `userid`, `status`, `showable`, `created_at`, `updated_at`) VALUES ('ssssssssssss', ' ds', 1, 1, '2017-09-14 03:04:14', '2017-09-14 03:04:14')
---
  def create
    @message = Message.new(message_params)
    respond_to do |format|
      format.json do
        response.set_header('Access-Control-Allow-Origin', "*")
        if @message.save